from pronoun import Pronoun
from pronoun_tree import tree

pronoun_detector = Pronoun(tree)
pronoun_detector.list_pronouns()

# Test words
test_words = [
    # First person
    "আমি", "আমরা", "আমাকে", "আমাদিগকে", "আমাদেরকে", "আমার", "আমাদের", "মোর", "মোরা",
    
    # Second person informal
    "তুমি", "তোমরা", "তোমাকে", "তোমাদিগকে", "তোমাদেরকে", "তোমার", "তোমাদের",
    
    # Third person informal
    "সে", "তারা", "তাহারা", "তাকে", "তাহাকে",
    
    # Second person formal
    "আপনি", "আপনারা", "আপনাকে", "আপনার", "আপনাদের",
    
    # Third person formal and literary
    "তিনি", "তাঁরা", "তাঁহারা", "তাঁদের", "তাঁহাদের", "তাঁহাদিগকে", "তাঁদেরকে", "তাঁহাদেরকে", 
    "তাঁহাকে", "তাঁকে", "ইনি", "এঁর", "এঁরা", "ইহাদের", "ইহাদেরকে", "ইহাকে", "এঁকে", 
    "উনি", "এরা", "এঁদের", "এদেরকে",
    
    # Pronouns with variants
    "ইহা", "ইহারা", "এই", "এ", "এরা", "উঁহা", "উঁহারা", "ওরা", "ওদের",

    "আমি", "আমরা", "আমাকে", "তুমি", "তোমরা", "তোমাকে", "সে", "তারা", "তাহারা", "তাকে", "তাহাকে", "তোমাদিগকে", "তোমার", "আমাদিগকে", "আমার", "আমাদের", "তোমাদের", "মোর", "মোরা", "আপনি", "আপনারা", "আপনাকে", "আপনার", "আপনাদের", "তিনি", "তাঁরা", "তাঁহারা", "তাঁদের", "তাঁহাদের", "তাঁহাদিগকে", "তাঁদেরকে", "তাঁহাকে", "তাঁকে", "ইনি", "এঁর", "এঁরা", "ইহাদের", "এঁদের", "ইহাকে", "এঁকে", "উনি", "ওঁর", "ওঁরা", "ওঁদের", "ইহা", "ইহারা", "এই", "এ", "এরা", "উহা", "উহারা", "ও", "ওরা", "ওদের",

    "তুই", "আপনা", "তোমা", "তো", "সে", "তিনি", "তাঁহা", "তাঁ", "তাহা", "তা", "যে", "যিনি", "যাঁহা", "যাঁ", "যাহা", "যা", "ইনি", "ইহা", "এ", "কে", "কি", "কী", "উনি", "উহা", "উহা", "ওঁ", "উহা", "কে", "কি", "কী", "কাহা", "কা",

    # সামীপ্যবাচক :
     "এ", "এই", "এরা", "ইহারা", "ইনি", 
    # দূরত্ববাচক :
     "ঐ", "ঐসব",
    # সাকুল্যবাচক :
     "সব", "সকল", "সমুদয়", "তাবৎ",
    # প্রশ্নবাচক :
     "কে", "কি", "কী", "কোন", "কাহার", "কার", "কিসে",
    # অনির্দিষ্টতাজ্ঞাপক :
     "কোন", "কেহ", "কেউ", "কিছু",
    # ব্যতিহারিক :
     "আপসে", "পরস্পর",
    # সংযোগজ্ঞাপক :
     "যে", "যিনি", "যাঁরা", "যারা", "যাহারা",
    # অন্যাদিবাচক :
     "অন্য", "অপর", "পর",
]

# Check if each word is accepted
for word in test_words:
    pronoun_detector.is_pronoun(word, generate_csv=True)

pronoun_detector.write_detection_results()