possessive_tree_commons = {
        'কে' : {'ই': {}, 'ও': {}},
        'র' : {'ই': {}, 'ও': {}},
        'তে' : {'ই': {}, 'ও': {}},
        'ই': {},
        'ও': {}
}

possessive_suffix_tree = {
    'টি' : {
        **possessive_tree_commons
    },
    'টা' : {
        **possessive_tree_commons
    },
    'টুকু' : {
        **possessive_tree_commons
    },
    'গুলো' : {
        **possessive_tree_commons
    },
    'গুলি' : {
        **possessive_tree_commons
    },
}
# Define the NFA with your structure
tree = {
    #first person
    'আম': {
        'ি': {'ই': {}, 'ও': {}}, 
        'ার': {
            **possessive_suffix_tree,
            'ই': {}, 
            'ও': {}
            },
        'রা': {'ই': {}, 'ও': {}},
    },
    'আমা' : {
        'য়' : {'ও': {}},
        'কে' : {'ই': {}, 'ও': {}},
        'দের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
            },
        'দিগকে' : {'ই': {}, 'ও': {}},
    },
    'মো' : {
        'র' : {},
        'রা' : {'ই': {}, 'ও': {}},
        'দের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        }
    },
    'স্বয়ং' : {
        '' : {},
    },
    'খোদ' : {
        '' : {},
    },
    'নিজ' : {
        'ে' : {
            'র' : {
                **possessive_suffix_tree,
            },
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        }
    },

    #second preson
    'তু' : {
        'মি' : {'ই': {}, 'ও': {}},
        'ই' : {'ই': {}, 'ও': {}}
    },
    'তো' : {
        '' : {},
        'মরা' : {'ই': {}, 'ও': {}},
        'মা' : {
            'কে' : {'ই': {}, 'ও': {}},
            'র': {
                **possessive_suffix_tree,
                'ই': {}, 
                'ও': {}
            },
            'দের' : {
                **possessive_suffix_tree,
                'কে' : {'ই': {}, 'ও': {}},
                'ই': {}, 
                'ও': {},
            },
            'দিগকে' : {'ই': {}, 'ও': {}},
            'য়' : {
                'ই': {},
                'ও': {},
            }
        },
        'র' : {'ই': {}, 'ও': {}},
        'রা' : {'ই': {}, 'ও': {}},
        'দের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        }
    },
    'আপন' : {
        'ি' : {'ই': {}, 'ও': {}},
        'া' : {
            'রা': {'ই': {}, 'ও': {}},
            'কে': {'ই': {}, 'ও': {}},
            'র': {
                **possessive_suffix_tree,
                'ই': {}, 
                'ও': {}
            },
            'দের' : {
                **possessive_suffix_tree,
                'কে' : {'ই': {}, 'ও': {}},
                'ই': {},
                'ও': {},
            },
        },
    },

    # Third Person
    'সে' : {
        '' : {},
        'ই': {},
        'ও': {},
    },
    'তিনি' : {
        '' : {},
        'ই': {},
        'ও': {},
    },
    'তা' : {
        'কে' : {'ই': {}, 'ও': {}},
        'ঁকে' : {'ই': {}, 'ও': {}},
        'হাকে' : {'ই': {}, 'ও': {}},
        'ঁহাকে' : {'ই': {}, 'ও': {}},
        'ঁ' : {},
        'র' : {
            **possessive_suffix_tree,
            'া' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'ঁর' : {
            **possessive_suffix_tree,
            'া' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'হা' : {
            'র' : {
            **possessive_suffix_tree,
            'া' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
            }
        },
        'ঁহা' : {
            'র' : {
            **possessive_suffix_tree,
            'া' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
            }
        },
        'দের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'ঁদের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'হাদের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'ঁহাদের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'হাদিগকে' : {'ই': {}, 'ও': {}},
        'ঁহাদিগকে' : {'ই': {}, 'ও': {}},
    },
    'ই' : {
        'নি' : {
            'ই': {}, 
            'ও': {},
        },
        'হা' : {
            'দের' : {
                'কে' : {'ই': {}, 'ও': {}},
                **possessive_suffix_tree,
            },
            'রা' : {'ই': {}, 'ও': {}},
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'ঁহা' : {
            'দের' : {
                'কে' : {'ই': {}, 'ও': {}},
                **possessive_suffix_tree,
            },
            'রা' : {'ই': {}, 'ও': {}},
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
    },
    'উ' : {
        'নি' : {
            'ই': {}, 
            'ও': {},
        },
        'হা' : {
            'দের' : {
                **possessive_suffix_tree,
                'কে' : {'ই': {}, 'ও': {}},
            },
            'রা' : {'ই': {}, 'ও': {}},
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
        'ঁহা' : {
            'দের' : {
                **possessive_suffix_tree,
                'কে' : {'ই': {}, 'ও': {}},
            },
            'রা' : {'ই': {}, 'ও': {}},
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {}, 
            'ও': {},
        },
    },
    'এ' : {
        '' : {
            'ই': {}, 
            'ও': {},
        },
        'ঁর' : {
            'া' : {
                'ই': {}, 
                'ও': {},
            }
        },
        'র' : {
            'া' : {
                'ই': {},
                'ও': {},
            }
        },
        'ঁদের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
        },
        'দের' : {
            **possessive_suffix_tree,
            'কে' : {'ই': {}, 'ও': {}},
        },
        'ঁকে' : {'ই': {}, 'ও': {}},
        'কে' : {'ই': {}, 'ও': {}},
    },
    'ও' : {
        'ই': {},
        'র' : {
            'া' : {
                'ই': {}, 
                'ও': {},
            }
        },
        'দের' : {
            **possessive_suffix_tree,
        },
        'কে' : {'ই': {}, 'ও': {}},
        'ঁ' : {
                'র' : {
                'া' : {
                    'ই': {}, 
                    'ও': {},
                }
            },
            'দের' : {
                **possessive_suffix_tree,
            },
            'কে' : {'ই': {}, 'ও': {}},
        }
    },
    'য' : {
        'ে' : {
            **possessive_suffix_tree,
            'ই': {},
        },
        'া' : {
            'র' : {
                'া' : {
                    'ই': {}, 
                    'ও': {},
                }
            },
            'দের' : {
                **possessive_suffix_tree,
            },
            'হা' : {
                'দের' : {
                    **possessive_suffix_tree,
                }
            },
            'কে' : {'ই': {}, 'ও': {}},
            'ই': {},
            'ও': {},
        },
        'াঁ' : {
            'র' : {
                'া' : {
                    'ই': {}, 
                    'ও': {},
                }
            },
            'হা' : {
                'দের' : {
                    **possessive_suffix_tree,
                }
            },
            'কে' : {'ই': {}, 'ও': {}},
        },
        'িনি' : {}
    }
}